turboman1234/STM32F4---Simulator/Simulator/Definitions/initPeripheral.c
        GPIO_Init(GPIOB, &GPIO_InitStructure);
        break;
        
    case OUTPUT_14:
        /* OUTPUT_14 ----> pin PE14 */
        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
        
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
        GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
        GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        
        GPIO_Init(GPIOE, &GPIO_InitStructure);
        break;
        
    case OUTPUT_15:
        /* OUTPUT_15 ----> pin PE12 */
        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
        
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
        GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
        GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        
        GPIO_Init(GPIOE, &GPIO_InitStructure);
        break;
        
    case OUTPUT_16:
        /* OUTPUT_16 ----> pin PA9 */
        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
        
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
        GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
        GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        
        GPIO_Init(GPIOA, &GPIO_InitStructure);
        break;        
    }
}

//-----------------------------------------------------------------------------------------------------------------------------------------------------
/* Configure GPIO pin as analog input for Trimmer */
void InitTrimmer(int trimmerID)
{   
    assert_param(IS_TRIMMER_ID_VALID(trimmerID));
    
    GPIO_InitTypeDef GPIO_InitStructure;
    
    switch (trimmerID)
    {
    case TRIMMER_1:
        
        /* TRIMMER_1 ----> pin PC1 */
        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
        
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
        GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
        
        GPIO_Init(GPIOC, &GPIO_InitStructure);
        
        break;
        
    case TRIMMER_2:
        /* TRIMMER_2 ----> pin PA1 */
        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
        
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
        GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
        
        GPIO_Init(GPIOA, &GPIO_InitStructure);
        
        break;
        
    case TRIMMER_3:
        /* TRIMMER_3 ----> pin PC2 */
        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
        
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
        GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
        
        GPIO_Init(GPIOC, &GPIO_InitStructure);
        break;
    }
    
    Init_ADC3();
}

void InitADC(int adcID)
{
    assert_param(IS_ADC_ID_VALID(adcID));
    
    GPIO_InitTypeDef GPIO_InitStructure;
    
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
    
    switch (adcID)
    {
    case ADC_1:
        
        /* ADC_1 ----> pin PC4 */       
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
        GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
        
        GPIO_Init(GPIOC, &GPIO_InitStructure);
        
        Init_ADC1();
        
        break;
        
    case ADC_2:
        
        /* ADC_2 ----> pin PC5 */
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
        GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
        
        GPIO_Init(GPIOC, &GPIO_InitStructure);
        
        Init_ADC2();
        
        break;
    }
}

void InitDAC(int dacID)
{
    assert_param(IS_DAC_ID_VALID(dacID));
    
    GPIO_InitTypeDef GPIO_InitStructure;
    DAC_InitTypeDef  DAC_InitStructure;
   
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    
    //Set GPIOA clock
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
    
    //Set DAC clock
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);
    
    /* DAC channel1 Configuration */
    DAC_InitStructure.DAC_Trigger = DAC_Trigger_None;
    DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;
    DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable;
    
    
    switch(dacID)
    {
    case DAC_1:        
        
        /* DAC_1 ----> pin PA4 */
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
        GPIO_Init(GPIOA, &GPIO_InitStructure);
        
        DAC_Init(DAC_Channel_1, &DAC_InitStructure);
        DAC_Cmd(DAC_Channel_1, ENABLE);
        DAC_SetChannel1Data(DAC_Align_12b_R, 0x0000);
        break;
        
    case DAC_2:
        
        /* DAC_2 ----> pin PA5 */
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
        GPIO_Init(GPIOA, &GPIO_InitStructure);
        
        DAC_Init(DAC_Channel_2, &DAC_InitStructure);
        DAC_Cmd(DAC_Channel_2, ENABLE);
        DAC_SetChannel2Data(DAC_Align_12b_R, 0x0000);
        break;
    }
}

